results/lb-pynlp-se-scalable-759637009.ap-southeast-1.elb.amazonaws.com:5000/2021-02-26-15-50-04/summary.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking lb-pynlp-se-scalable-759637009.ap-southeast-1.elb.amazonaws.com (be patient)...INFO: POST header == 
---
POST /api/nlp/v2/intent?userid=5f427f94a5c7f67b3985cc8d HTTP/1.0
Content-length: 31
Content-type: application/json
authorization: YaMtrXkKMTvxB8E4L8uW77YMcxSSL4KQ
Host: lb-pynlp-se-scalable-759637009.ap-southeast-1.elb.amazonaws.com:5000
User-Agent: ApacheBench/2.3
Accept: */*


---
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 26 Feb 2021 15:50:04 GMT
Content-Type: application/json
Content-Length: 39
Connection: close
Server: gunicorn/20.0.4
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 26 Feb 2021 15:50:04 GMT
Content-Type: application/json
Content-Length: 39
Connection: close
Server: gunicorn/20.0.4
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 26 Feb 2021 15:50:04 GMT
Content-Type: application/json
Content-Length: 39
Connection: close
Server: gunicorn/20.0.4
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 26 Feb 2021 15:50:04 GMT
Content-Type: application/json
Content-Length: 39
Connection: close
Server: gunicorn/20.0.4
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 26 Feb 2021 15:50:04 GMT
Content-Type: application/json
Content-Length: 39
Connection: close
Server: gunicorn/20.0.4
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 26 Feb 2021 15:50:04 GMT
Content-Type: application/json
Content-Length: 39
Connection: close
Server: gunicorn/20.0.4
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 26 Feb 2021 15:50:04 GMT
Content-Type: application/json
Content-Length: 39
Connection: close
Server: gunicorn/20.0.4
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 26 Feb 2021 15:50:04 GMT
Content-Type: application/json
Content-Length: 39
Connection: close
Server: gunicorn/20.0.4
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 26 Feb 2021 15:50:04 GMT
Content-Type: application/json
Content-Length: 39
Connection: close
Server: gunicorn/20.0.4
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 26 Feb 2021 15:50:04 GMT
Content-Type: application/json
Content-Length: 39
Connection: close
Server: gunicorn/20.0.4
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 26 Feb 2021 15:50:05 GMT
Content-Type: application/json
Content-Length: 39
Connection: close
Server: gunicorn/20.0.4
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 26 Feb 2021 15:50:05 GMT
Content-Type: application/json
Content-Length: 39
Connection: close
Server: gunicorn/20.0.4
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 26 Feb 2021 15:50:05 GMT
Content-Type: application/json
Content-Length: 39
Connection: close
Server: gunicorn/20.0.4
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 26 Feb 2021 15:50:05 GMT
Content-Type: application/json
Content-Length: 39
Connection: close
Server: gunicorn/20.0.4
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 26 Feb 2021 15:50:05 GMT
Content-Type: application/json
Content-Length: 39
Connection: close
Server: gunicorn/20.0.4
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 26 Feb 2021 15:50:05 GMT
Content-Type: application/json
Content-Length: 39
Connection: close
Server: gunicorn/20.0.4
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 26 Feb 2021 15:50:05 GMT
Content-Type: application/json
Content-Length: 39
Connection: close
Server: gunicorn/20.0.4
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 26 Feb 2021 15:50:05 GMT
Content-Type: application/json
Content-Length: 39
Connection: close
Server: gunicorn/20.0.4
Access-Control-Allow-Origin: *


LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 26 Feb 2021 15:50:05 GMT
Content-Type: application/json
Content-Length: 39
Connection: close
Server: gunicorn/20.0.4
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 26 Feb 2021 15:50:05 GMT
Content-Type: application/json
Content-Length: 39
Connection: close
Server: gunicorn/20.0.4
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 26 Feb 2021 15:50:05 GMT
Content-Type: application/json
Content-Length: 39
Connection: close
Server: gunicorn/20.0.4
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 26 Feb 2021 15:50:05 GMT
Content-Type: application/json
Content-Length: 39
Connection: close
Server: gunicorn/20.0.4
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 26 Feb 2021 15:50:05 GMT
Content-Type: application/json
Content-Length: 39
Connection: close
Server: gunicorn/20.0.4
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 26 Feb 2021 15:50:05 GMT
Content-Type: application/json
Content-Length: 39
Connection: close
Server: gunicorn/20.0.4
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 26 Feb 2021 15:50:05 GMT
Content-Type: application/json
Content-Length: 39
Connection: close
Server: gunicorn/20.0.4
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
..done


Server Software:        gunicorn/20.0.4
Server Hostname:        lb-pynlp-se-scalable-759637009.ap-southeast-1.elb.amazonaws.com
Server Port:            5000

Document Path:          /api/nlp/v2/intent?userid=5f427f94a5c7f67b3985cc8d
Document Length:        39 bytes

Concurrency Level:      25
Time taken for tests:   0.818 seconds
Complete requests:      25
Failed requests:        0
Total transferred:      5575 bytes
Total body sent:        7950
HTML transferred:       975 bytes
Requests per second:    30.55 [#/sec] (mean)
Time per request:       818.360 [ms] (mean)
Time per request:       32.734 [ms] (mean, across all concurrent requests)
Transfer rate:          6.65 [Kbytes/sec] received
                        9.49 kb/s sent
                        16.14 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    1   0.0      1       1
Processing:   253  545 195.2    641     817
Waiting:      253  545 195.2    641     817
Total:        254  546 195.2    642     818

Percentage of the requests served within a certain time (ms)
  50%    638
  66%    680
  75%    691
  80%    722
  90%    796
  95%    802
  98%    818
  99%    818
 100%    818 (longest request)